{
    "reviews": [
        "The game is fine but I suggest the ability for us players to \"dodge\" games at the cost of some credit score before it can start since some players are forced to play a game that they don't want to play. For example, someone doesn't want to play because of the given team composition. He can dodge it\nFull Review",
        "As much as this game used to be fun. I'd have to give it a two star. Only because of the resources pack. I literally have to wait for about a hour or two just for the resources pack to finish downloading. And it even pauses or resets whenever I'm in another game or when I'm in a match. And I'm just\nFull Review",
        "The Chessgame concept is very good. Good job! 5 star for that. 😉 Update: there are alot of glitches in the Chessgame. 1. When you execute a player in the game, instead of your name being announced as the \"excecuter\" another player's name comes up. Happens about 2 out of 5 times. 2. When you have lo\nFull Review",
        "The game itself is good tho, but can u pls do your best to eradicate all of the cheats that can be used in your game. There are so many players in the game that is using a map hacking system. It is unfair on other players that is working hard to enhance their skills, ranks, and even the coordination\nFull Review",
        "The gameplay is easy to understand and learn. Different events allows players to set goals. Different sub-games allows players to enjoy more. Overall, the game is amazing by itself. But, there are many issues about toxic, unsportsmanlike and racist players that make the game \"not so great after all\"\nFull Review",
        "A very fun LOL rip off. Very fun. Almost an exact clone of league a few years ago. It's awesome! On the downside. I logged back on tonight and had a message that some sore loser on my team reported me for feeding. Ridiculous. The whole team had a bad game because of a lack of lane control. I couldn'\nFull Review",
        "Super lag even if I'm connected to a stable wifi network. There's a lot of cheaters too. I just find it so disappointing that until now we cannot get rid of those cheaters. I love MLBB so much and I've been playing this game for almost 5 years now. But tha game experiences is making decide to stop p\nFull Review",
        "I'm giving this game 3 stars because of how the match making works. The system is so broken, that I, a rank of Grandmaster, was being matched up with Legends or sometimes Mythic rank. The system is so broken that it needs to be fixed, I love the game, in fact it is a great game but the way how match\nFull Review",
        "Please fix the problem of your apps. Why it is not working well, I waste money for this and I don't get why its not working well. Even the character always lag and I can't switch my past account. Duhh this new version now Is getting into my nerve not like before! So please fix this cause I feel like\nFull Review",
        "ok, but I hope that there is an option to merge account, and as far as with my experience with the game, I think there is a problem with the matching and pairing teams, with the team matching, why am I being paired with either higher level or way lower level, and with the matching of team vs team, m\nFull Review",
        "I will give you 5 star if you fix my problem. My thumb is hard to press the skill button. It's because the skill buttons are little far from the edge of the screen. I have this issue since i change my phone. I hope you will make a setting for the skill and attack button position. It will help me and\nFull Review",
        "Overall, a fun game, but... The limited restrictions of unlocking new legends is rough. Some you have to pay real money for, others it takes such a long time to save 32000 credits to unlock one hero... It just upsets me. But other than that, it is pretty neat to play, and it definitely gives you som\nFull Review",
        "Gameplay, Graphics and Balances are fine so far. I will be reducing my rating to 1 star for now. I think its time the devs should think about on how to protect those players that are struggling to rank up. I have teamed up with some players that are very narrow minded during matches some are afk, i\nFull Review",
        "At first it was a fun game. I easily learn how the game works since I have played some games already before. Since the new update came, I have been experiencing a laggy signal. Everything is lag. Worst is, some players, use cheat in rank match. Like Maphack, lagger, etc. I have seen a lot of reports\nFull Review",
        "I really love this game but I would only give it 4 stars because of one reason. That reason was that I bought a protection points card and accidentally used it with the protection points that you can earn by playing rank. I dont understand the reason of using both of them in one loss ranked game. No\nFull Review",
        "As of now, the game is very much okay than the previous month. The maphackers are reduced, just the imbalance sometimes. Moontoon is good at teaming you up to the people who lacks proper gameplay, lol. But, seriously it is so hard to find good team mates. Anyways, good job for making the game much m\nFull Review",
        "The game is great. But i suggest don't nerf/adjust every week or month. Because players might get bored or might be sad because every week you adjust gameplay. As for other players that are slow to adopt in the current gameplay. When they start to learn the new meta or hero then suddenly it got nerf\nFull Review",
        "Game was cool till the moment where there are so many hackers that made the game lag most of the time. It is frustrating to know that when you're experiencing all the lag in Rank mode and you get disconnected most of the time. Adding to that the unfair credit score deduction and the lost of another\nFull Review",
        "I was enjoying it initially but later it started having so much ping in every god damn single match that you can't do anything but stuck in the game and then out of nowhere I was already killed. I have reported it several times but there is not point coz it's never been addressed so far. Really real\nFull Review",
        "Absolutely annoying as hell. It's mainly pay to play as most of the heroes need to be purchased with a material that is capped weekly. You can earn 8000 coins a week and each stronger hero costs 32000. I'm not about to play 80 hours a week just to get a hero once a month. On top of that, I've had ab\nFull Review",
        "This game really needs a better penalty for the negative players. It has been 2 years since I played this game and I got to say, the old ML was way better. The problem about this game are the Teammates, it's like playing russian roulette you get the toxic ones or reliable ones. Sometimes the teammat\nFull Review",
        "I played this game for about 2 years now.. It's getting worse and worse. Matching up system is out of control. Ur place with people constantly afk and u cant do nothing about it. Also I paid for character and it's gone. Wow where is my money. I'm telling u this game is not worth trying. Also where i\nFull Review",
        "Its a great game but could be better with some more changes like: 1) being able to view your friends ongoing battle so that you can know if you should wait or start playing 2) being able to challenge clan mates in a quick dual 3) CLAN WARS !!! ( I know it seems impossible but it would be fun if it t\nFull Review",
        "This game has 3 BIG PROBLEMS. 1. Heros are horrifically imbalanced, you can unleash the full barrage of your hero skills and nearly scratch the other guy, all he dose is sneez on you and You're either dead or half dead. 2. Turret campers (IF YOU DON'T KNOW WHAT THIS IS LOOK IT UP), you will find at\nFull Review",
        "The game play is great. No other games could give this to you. Except for the matching, its horrible. You get scores like 5 vs 43 as if we were like grade 1 on the battlefield againts giants and aliens. A much fairer games is way better. The graphics, hero nerfs, teamwork, objectives and strategies\nFull Review",
        "1. Awful and unfair matchmaking. The enemy is clearly much more experienced yet you pair the beginners or us who are not that good in the game yet. 2. Toxic people in the game is too much. Enemy clearly has teamwork most of the time yet I get paired with players who just trashtalk early in the game,\nFull Review",
        "The game really sucks. I think ita just only for those who spend diamonds to rank up easily. For 10 consecutive battle i never even had 1 or 2 good player on the team. And after the battle. The annoying red dots popping out everytime that makes the interface so damn lag. And those purple stars. For\nFull Review",
        "I used to like this game very much. But now I can't even play this without being charged with AFK behaviour. Even if I am the MVP with the least death rate, some players still report and my credits score decrease. I hate this game now. I am never downloading this again. I just want a peaceful gamepl\nFull Review",
        "It always have an issue about lagging & crashing while playing. I reformat my phone several times to think what is the main problem, even thoug I deleted all my files ML is used to what I expected (lag always). Im sorry to tell that but it is a fact I/we usually experienced. I hope you can fix this\nFull Review",
        "i've been playing this game for a long time. i love this game and everything was good but sometimes i uninstalled it because i can't login. and it happen again today, my screen suddenly turns black and i waited about a few minutes and it still pitch black eventhought my connection is good. this happ\nFull Review",
        "its good and okay. i find it quite entertained by the game thanks to the creator/s but even though it is a great game there are some issue such as lagging, bugs, and so on. i also wish that they appreciate our attention playing their game and gift us such as valuable items such as skin, emote, recal\nFull Review",
        "I am a big fan of battle arena games, and I spent hours and hours just to play. I love this game, but I have a suggestions. ML Rank games are so toxic especially on lower ranks (Warrior to Grand Master) there's no teamwork they just pick a hero they want and they don't see what's needed in the team,\nFull Review",
        "The new updates consumes more memory. I love this game. But can you make an update that would make us purchase the hero we buyed and didn't use often. So that we can buy new one with our battle points. Lastly,I nearly forgot the translation that you said last time. I would like to partake for it. I\nFull Review",
        "Not gonna change my rating. I do enjoy the game but all the fun is ruined simply because of cheaters using maphacks, toxic players, players doing AFK in the middle of the game, and unbalanced heroes. Sometimes it disconnects in the middle of the game tho the data is good and sometimes find it hard t\nFull Review",
        "I stopped playing this game for a while because it was getting pointless, a year later, I try to log back in to my moonton account, but it didnt work. I used the forgot password link to change it, but when i try to log in again, it says that my new password is wrong. I'm assuming that my old account\nFull Review",
        "I have played this game for almost 3 years. Now, when I played rank mode against some enemies, it all became lagged. And it's not just me, but, everyone on my team. We're all in different locations and my internet that ive subscribed is 100Mbps. Yet, we are all experience the same lag. This is obvio\nFull Review",
        "I only started playing it a year ago and it was working perfectly fine before. But the game seems to be getting poorer with each updates now. Its lagging frequently and I'm not able to play for even 20 seconds properly. Please fix it moonton. The matchmaking also seems to be getting better but it st\nFull Review",
        "This game never failed to entertain me. (Even tho most of the time I always lose my game) but can you do something about the match making. It's kinda unfair you know. I'd be on legend V and all of my teammate would be in between epic II or I and legend V or IV, then our opponents woild be like aroun\nFull Review",
        "Always been a fan of this game (I was even a Epic in rank) but what disappoints me and made me uninstall this app is that it's SUPER LAG & THERE ARE A LOT OF CHEATERS. It's so annoying that every match you lose and rank down just to know that your opponent is cheating (Map hacks, they make the oppon\nFull Review",
        "-In the middle of Magic Chess, why is it when I'm low on HP, I'm suddenly matched up against the person with the highest HP and win streak? Again, it's always in the middle rounds. It's difficult to make a comeback when the odds are already against you. MC's really fun, but annoying at times. -Too m\nFull Review",
        "-In the middle of Magic Chess, why is it when I'm low on HP, I'm suddenly matched up against the person with the highest HP and win streak? Again, it's always in the middle rounds. It's difficult to make a comeback when the odds are already against you. MC's really fun, but annoying at times. -Too m\nFull Review",
        "It still has a lot of improvement. Not the game with a lot of gifts on it's pocket, you have to pay everything to have a good skin. And has a favoritism on streamers when you experience having a game against streamers you may experience Lag or Unable to move even though you have a good connection. I\nFull Review",
        "i played this game since i was a grade 9 student. and as the time passes by, it really improves a lot. through the fun and exciting events and thrilling games and experiences that i have playing this game. i cannot stand my day without playing mobile legends, seems like it was part of me since i pla\nFull Review",
        "I've had this app for less than 24 hours & I've been penalized for \"feeding\", which is stupid. I'm trying to play & sometimes do great but other times die repeteadly bc the opposing team has been playing for more than a DAY. The app also glitched & wasn't letting me choose any player. I clicked on t\nFull Review",
        "Keep improving, especially the smoothness of the game. Undoubtedly addictive with lots of hero variations to choose from. You'd definitely find the hero that will best suit your playstyle. Great graphics with many in-game events to add new colors and excitement to the game. More awesome heroes to ma\nFull Review",
        "A good rip off game from LoL. I didn't really want to play this game but since my friends are playing I gave it a shot and boy it disappointed me greatly especially the matchmaking. Matchmaking is freaking ridiculous. No matter how passionately or good you play your team doesn't do good or worse, ju\nFull Review",
        "I have been playing for a couple of years now as a solo player and more than half the time I get beaten up. The main reason is because many other players play in teams where players can coordinate and strategise. I can't find friends who can sit down together at the same time to play. But I still fi\nFull Review",
        "Too many updates that makes up large space. It crashes sometimes. When Im playing, it freezes and when the game is about to start, its just restarting... Whoooah! I started to hate it. Sometimes it took so long to return after the game is over. Grrr... Maybe if it will continue, I will uninstall it.\nFull Review",
        "The update for the magic chess sucks. The randomization of spawning characters are very unfair. I had a game in this mode wherein an opponent got a 3 star hero after the initial 3 rounds. I don't know what happened but that's just unfair. Also, the number of items may have increased, but it's not li\nFull Review",
        "This game help me a lot becaise It keeps me away from boredom. Really thumbs up to the creator and to those people soing their work well to keep this game in shape. Keep it up people. More creativity and idea to this game so user can always say that their is something new and unique in this game. Mo\nFull Review",
        "Poor fps performance. Always getting lobby of foreign countries. Can't mlbb detect from my location which server to connect. Asia1 is a vast server. Keep me within my country so that I can have a fair battle. Playing at red ping, skills and movement delayed by 1-2 sec. I use wifi and yet I feel the\nFull Review",
        "I hate the credit score system and how it can be lowered even if I'm trying my best and not even being the worst on the team. I don't know if it is spite or what but I wasn't even doing ranked. I don't think it should be affected unless you leave, go afk, or purposely try to lose. But that last one\nFull Review",
        "All good except on starting the game. Most of the time I will reach 55% then will load until 90% plus then will get disconnected and will reload again. So in short when I start the game most of my teammates and enemies are already level 3 so i was level gap even in coins. My internet is good and my\nFull Review",
        "I am not satisfied to the game, but it's just the players who are toxic and verbally abusing other players, leading the game to be stressful. They troll and saying that \"This is only game.\" but it's not; several players treat this game as their favorite pasttime, especially if they're tired and then\nFull Review",
        "I literally get paired with idiots EVERY SINGLE TIME!!! and they put you up against people who are in teams!!! Hows that fair? I was literally winning most of the time at the beginning. Once you start leveling your profile a lot, the game starts giving you a losing streak. My profile lvl is 11 and I\nFull Review",
        "I love the game, but maphacks, vpn users, and rampant lag while clashing keeps me from giving it 5 stars. Please, fix it.. there are a lot of people who post cheats and scripts in YT and the internet that just ruin your game, and your not doin anything. My winrate has drop to 46% frm 60.. and don't\nFull Review",
        "The game is great, it's just the players will report you if you do too good, or just for no apparent reason, and since there is a point penalty system, and if you have 60 points and below you cant play, so you can already see why I'm making it a 1 star remark, you guys need to fix this. Is just unfa\nFull Review",
        "Was amazing to play this during the first year when this was launched. But over the months, and its continous updates, it made this game hard to play. It keeps on crashing and players were being punished automatically even if it is not their intentions not to play well. I hope that the app can detec\nFull Review",
        "Great game. Definitely not pay to win. Purely skill. I find that classic games are much more fun. I'm stuck in rank as grandmaster and it's hard to progress unless you find a team to play with but that's hard when no one plays at the same times. Other then that it's a great game, been playing over t\nFull Review",
        "I really like this game, yea. But the game's lag issue has not been fixed. The game has a speed mode which will fix this. But the speed mode doesn't seem to work for me atleast. Whenever I play an online game the ping spikes up really quickly and it doesn't me play. It messes up my rotation and the\nFull Review",
        "Ever since you created that speedy version you made us download and promised us better gaming experience, the game has been having loading issues. Just yesterday, I can't even start a game 'cause it won't let me and take note, that happened to everyone too at that time which caused chaos on chat roo\nFull Review",
        "Great game but hopefully change the ranking system. The players rank should depend on his/her game because when im playing this game some of my team doesn't cooperate. Plus match making is so unfair I always stock at the lossing team. I always lose many stars cause of this. I suggest if there is a 3\nFull Review",
        "I played ML for over 2 years and I loved it, but the last update about ML 2.0 wasn't working for me. My friends updated it in play store and when they opened the game a new home screen appeared but when I opened it, it was still the old one. Also last Saturday (October 12, 2019) Me and my friends we\nFull Review",
        "I have been playing this game since season 1. After installing latest update the game lags so much that I cant even play it. It became a useless memory eating garbage. The game is good as I have been playing it for years now, but the matching really affects the experience. There are lots of garbage\nFull Review",
        "Every after rank game it keeps on dragging me to play classic and arcade. It says I'm on tutorial mode, I know how to play those modes so what the hell is going on? I did tutorial mode like last year, I think? Then the signal will be red which means the connection is bad. Can you fix your app, pls?\nFull Review",
        "Great app. It is really optimized for mobile. What's not good is the matchmaking system sometimes sucks... The rest just feels fully optimized but it also requires more powerful devices to work smoothly on high graphics. Another thing to note is that some chips aren't supported for ultra graphics. M\nFull Review",
        "This game is awesome! But unfortunately, it's too hard to rank up in solo. It's better to play with team guys, so you can rank up easily. Haha Thank you MLBB for all the efforts to make this game more better and also banning those hackers. It's a really big help for the players who played fair. God\nFull Review",
        "First of all this game's concept is copied and secondly these guys never seem to fix the lag problem. They run after skins all the time and after selling certain amount of skins they will nerf the hero . And if you face lag problem while playing, don't think it's your internet connection problem. It\nFull Review",
        "This game crashes.. When I play classic, I play well but when I play rank, It Just lag! There's nothing wrong with my internet connection.. Then, so many of my teammates trashtalking! When I don't even play this game but installed, it really drains my battery and causes my phone to lag.. Pls. Fix th\nFull Review",
        "Things were fun if maphacks didn't exist at all. People were abusing maphacks because they want to make their gameplay easier and at the same time make fun of other players. Some pro and veterans who are really good are being affected by these as this was used for excuses but it's just pure skills.\nFull Review",
        "It was an awesome game before, but after few update the game is quite laggy even though the internet is good, ang the match making system is absurd, there are glitches when i play, and every gameplay i have there is always 1 player who either feed or afk, the game was cool before but now i dont like\nFull Review",
        "Ever since the new update, I have been having network problems, like disconnecting and reconnecting during and after a game, when my WiFi is working just fine. Now, I can't load the game using my Wifi. It gets stuck at the loading page, showing error 86. Its not due to my network because other apps\nFull Review",
        "New update,the game become worst and worst. My teammates have been afk for 3 minutes since the game starts and then there's no surrender? What a joke. I'll never gonna rate this game more than 1 star because this is just stupid! I hope u can just make sure afk people can't play for 1 day. That's all\nFull Review",
        "Used to like this before, reinstalled this for almost a week now after three consecutive season. Now there's a cheater everywhere, new heroes become too overpower, can't even play a decent game because of lags. I can play with atleast 1mbps of internet speed before. But now can't even play with 8mbp\nFull Review",
        "I'm not satisfied because each time when I'm playing rank mode the server always lagging and hang. At one time my team n me successfully enter to final play MCL but kick all of us out and we cant enter back into the game to play the final match. I paid so much to buy the diamonds at the end the serv\nFull Review",
        "It's a very good app. It has good graphics and has a pretty simple goal- to win the battle. What I find most bothersome though is the fact that whenever I lag even with a stable network connection, it says that I went AFK and that it ruins everyone else's experience in the game. I wouldn't be able t\nFull Review",
        "It's so fun!!!!! You can play all the games there and it doesn't take long to load, sometimes I get a black screen and can't play but it's ok! I love the quality and everything!! I recommend playing it and give it a try, and for just one week, You can be a pro at this game!!! So cool!!! for my first\nFull Review",
        "I think, the game grew into something big and has made an impact among gamers, and I say the game is pretty much good, only the community makes it toxic and unbearable, regardless, there is one issue that i would like to address and that is the fair creation of skins amon heroes, I mean a lot of her\nFull Review",
        "Strength : Easy to play, plenty of free skins, not consuming lots of space, developers that always listen and appreciate the users, many events and gifts. Weakness : some heroes need to have them revamped or remodeled, lame Hero's design (such as Karina Mia Ling etc) - but their skins are lit tho, p\nFull Review",
        "Well, basically developers should focus on ping issue, reconnecting 4/5 in every single match, unfair matchmaking, glitch etc instead of making new skins and releasing new heroes. This is my opinion for this game and i hope you guys fix all of those problems or else you guys will lose a huge amount\nFull Review",
        "Ive experience so much lagging at the middle of the rank game, eventhough i have a very good internet connection, both wifi and mobile data open, still lagging ang reconecting, delayed movement by 2 seconds. Hang at the middle of a rank game so i restart mobile legends, when i reopened, my credit sc\nFull Review",
        "The experience in this game is bulls*** no doubt the gameplay is good but it lags all the time. Major problems you may face playing this game is bcaz of lag and teammates are ridiculous. Major afk issues, most of all you you will surely loose accounts the game maintenance team is sh** lags out of no\nFull Review",
        "The game is great but still you have to fix some issues regarding your early-season heroes which means you have to balance it. The developer always release new heroes every now and then but the early season heroes are like junkies. In my opinion, I suggest to balance early season heroes versus meta\nFull Review",
        "Its a great game, I really love how you can make certain combos with your team and How the game is designed generally. What i dont like is the number of people that are using cheats in this game I've encountered dozens of map hackers recently and I believe if this will not be fix immediately the gam\nFull Review",
        "A MOBA game. In-game price are reasonable except for lucky box or events where you need 5k plus diamonds. They don't balance heroes so just use meta ones. Old heroes are basically dead. Starlight is a good investment someone who's starlight for a year. Rank game is newbie friendly just pick what you\nFull Review",
        "Our game is on going. The network connection is good. Then suddenly all of my teammates left the match also our enemy. What happened? We cannot contact customer service. It is not answering our queries. The game crashed, the heroes is not moving all at the same time. Game history is not shown. I thi\nFull Review",
        "I leave the game a couple of months and they nerf the heroes I like to the ground and I was fine with that,but if I got owned in a game I get a ban although I wasn't reported is just developers putting bots to screw with our experience,why would I have all these assists and kills if I was afk? And i\nFull Review",
        "I don't get it why I crashed sometimes and couldn't get in back the game or my current game was already finished. And I got deduction of my stars in ranking mode because of glitching that I find weird because my connection is good. Also there are times I got deducted points because of a report which\nFull Review",
        "Used to be my fav games. But the matchmaking alghoritm sucks. It really sucks and everyone keeps complaining about it and the developer never made any improvement on this. It is so unfair having very bad team8 everytime even though we always be mvp of the match. You will experience lose streak and h\nFull Review",
        "I've been playing this game for almost 3 years and I slowly watched as the community starts to deteriorate into toxic players, hackers(map hackers,lag hackers,etc.), and unbalanced meta hero lineups, some of my friends have quitted and deleted the game because of this and I don't want to be among th\nFull Review",
        "For umm the people with having difficulty playing this game they offer tutorials for heroes,you can report the match you had, and if you really want help I guess put ID besides ur review and say what you don't know so that the people that actually know can help and you and let you enjoy the game lik\nFull Review",
        "Maphack is getting worse. MH users are smarter now. They don't completely use what they see and sometimes intentionally getting killed or miss a specific skill so it becomes not to obvious, to avoid reports from the opponents. Find a way to detect this cheat without relaying on reports. For now i ha\nFull Review",
        "Can't play this game because it was lagging too much, even though you change the settings and all the stuff that can reduce the lag or a high RAM phone, but still won't change a thing, still lagging. this is why I started too quit instead, please fix it. I'll change it to five star when the game pla\nFull Review",
        "Free heroes are extremely weak. The amount of gold you gain per match is abysmal so you're stick with the extremely underpowered free heroes for a long time. Very big lack of balancing. Needs to be worked on very much. - make better heroes available to new players - balance the heroes Other than tha\nFull Review",
        "I have been playing this game since season 1 and all I can say is that this game has really evolved a lot, it keeps improving not just only the game, but it's community as well. The game keeps getting better and better with fun heroes to play with and different game modes. Having lots of events whic\nFull Review",
        "Superlag , Its not working on mobile data or even wifi 5ghz 25mbps, Ping keep on jumping from 22ms to 220-380 super lag. I don't know if it's a cheat or a bug. I enjoyed it before but now it getting worst and worst. I know there is no problem with the phone (Realme5pro 8gb/128gb) other online games\nFull Review",
        "I could have given this app with 4 or 5 star but with my experience in bad fps which they say can be configured thru settings, still not working. My wifi signal is at full bar yet when I play ranked or Classic, I just can't experience what they call fair game because of this fps problem. I have trie\nFull Review",
        "This the worst MOBA out there. I keep it installed as a reminder. What's wrong with it? You have to play with a full party as the match up will place high emblems players with low emblem players. Sounds fun for the enemy team but no that's just you. My friend and I have enjoyed playing games togethe\nFull Review",
        "There is something wrong with the game, maybe some programming errors or something of the sort. After buying some items during the game, i'm unable to buy more items and as a result, my character remains at the same level while other players' character stats increase and they become more powerful. I\nFull Review",
        "Game is good but Matchmaking is really bad, probably the worst matchmaking compared to other games I will rate the matchmaking 2.3/5 Game items are pretty expensive, especially events where you use alot of money but still not getting it in the end. Those 2 are the only issue for me other than that g\nFull Review"
    ]
}